#+title: Problem Set 3
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2025-10-11>
#+lastmod: <2025-10-13 14:20>
#+options: num:t
#+startup: overview

** Solution
#+begin_src julia :results output
k = 1

function S(n::Int)
    return powermod(2, n, 11) == 1   # (2^n - 1) % 11 == 0  <=> 2^n % 11 == 1
end

while true
    global k
    if S(k)
        println(k)
        break
    end
    k += 1
end
#+end_src

#+RESULTS:
: 1
: S (generic function with 1 method)
: 10

Therefore, 11|(2^n - 1) where n = 10.
